cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "leoafarias/fvm"

brew "git"
brew "openjdk@17"
brew "terraform"
brew "mas"
brew "gh"
brew "fvm"

cask "1password"
cask "1password-cli"
cask "ngrok"
cask "warp"
cask "xcodes"
cask "zoom"
cask "slack"
cask "docker"
cask "arc"
cask "raycast"
cask "tableplus"
cask "notion-calendar"
cask "deepl"
cask "ledger-live"
cask "postman"
cask "visual-studio-code"
cask "readdle-spark"
cask "microsoft-teams"
cask "skype"
cask "spotify"
cask "android-studio"
cask "cleanmymac"
cask "vpn-by-google-one"
cask "another-redis-desktop-manager"
cask "minisim"
cask "google-japanese-ime"
cask "karabiner-elements"
cask "alfred"

mas "Magnet マグネット", id: 441258766
mas "LINE", id: 539883307