brew "git"
brew "mas"
brew "gh"
brew "asdf"
brew "starship"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"
brew "peco"
brew "supabase"
brew "lefthook"

cask "ngrok"
cask "1password"
cask "1password-cli"
cask "xcodes-app"
cask "zoom"
cask "slack"
cask "docker-desktop"
cask "arc"
cask "raycast"
cask "tableplus"
cask "notion-calendar"
cask "notion"
cask "proxyman"
cask "deepl"
cask "ledger-wallet"
cask "postman"
cask "visual-studio-code"
cask "readdle-spark"
cask "microsoft-teams"
cask "spotify"
cask "android-studio"
cask "android-platform-tools"
cask "cleanmymac"
cask "karabiner-elements"
cask "google-chrome"
cask "font-fira-code-nerd-font"
cask "iterm2"
cask "discord"
cask "cursor"
cask "keyboardcleantool"
cask "cyberduck"

mas "Magnet マグネット", id: 441258766